0.825rad/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (fvMotionSolvers libinverseDistanceDelayedDiffusivity);

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt endTime;

endTime 0.025;
deltaT          0.00001;
writeControl    timeStep;

//writeInterval   1; // 1.5;
writeInterval   50;
adjustTimeStep  no;
maxCo       40;
maxDeltaT   0.0018697;

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   9;

runTimeModifiable true;

functions
{
	/*preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }*/
}



// ************************************************************************* //

