0.825rad/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}
/*
ddtSchemes
{
    default backward;
}*/

gradSchemes
{
    default	cellLimited leastSquares 1;
    grad(U)	cellLimited leastSquares 1;
    limitedGrad	cellLimited leastSquares 1;
}
/*
gradSchemes
{
   default         Gauss linear;
   grad(U)  cellLimited Gauss linear 1.0;
}*/

divSchemes
{
    default Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
      default Gauss linear limited corrected 0.5;
}
/*
laplacianSchemes
{
    default         Gauss linear corrected;
}*/

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default limited corrected 0.5;
}
/*
snGradSchemes
{
    default         corrected;
}*/

wallDist
{
    method meshWave;
}


// ************************************************************************* //
